{
    "professor_info": {
        "firstName": "Shan",
        "lastName": "Wu",
        "department": "Physics",
        "school": "Santa Clara University",
        "avgRating": 1.8,
        "avgDifficulty": 4.4,
        "numRatings": 37,
        "wouldTakeAgainPercent": 16.2162
    },
    "comments": [
        {
            "comment": "I went into this class bracing for the worst, based off this page. But I just don't get it. Dr. Wu is a great professor. She explains things really well, and if you don't get something, just go to her office hours and she'll clear it up for you. She *wants* you to get it.\n\nPhysics is just difficult in general, and people blame it on the professor.",
            "tags": "Caring--Accessible outside class",
            "class": "PHYS31",
            "date": "2025-09-25 06:16:31 +0000 UTC"
        },
        {
            "comment": "Professor Wu doesn't deserve how bad of a reputation she has - she's a fine teacher and if you understand all the homework you'll be fine. Tests can be pretty tough but she gives lots of partial credit",
            "tags": "Lots of homework",
            "class": "PHYS31",
            "date": "2025-07-02 02:27:33 +0000 UTC"
        },
        {
            "comment": "Shan Wu is a nice person but needs to stop teaching&#8212;(she can't). Her lectures are boring and confusing, she doesn't answer questions in class, she ba",
            "tags": "Tough grader--Lecture heavy--Test heavy",
            "class": "PHYS31",
            "date": "2025-05-28 18:27:04 +0000 UTC"
        },
        {
            "comment": "Physics is not an easy class but she gives you every opportunity to get hep from her. Take it. She cares and wants you to do well. Do your homework, attend office hours. Great professor.",
            "tags": "Participation matters--Caring--Accessible outside class",
            "class": "PHYS31",
            "date": "2025-05-18 18:42:58 +0000 UTC"
        },
        {
            "comment": "Read the textbook on your own!!",
            "tags": "Tough grader--Beware of pop quizzes",
            "class": "PHYS31",
            "date": "2025-04-04 21:05:02 +0000 UTC"
        },
        {
            "comment": "She gives a lot of partial credit, and everything outside of the actual lectures is standard. But her lectures are unbearable. She uses her phone for some reason, notes all over the place, poor english.",
            "tags": "Graded by few things",
            "class": "PHYS31",
            "date": "2025-04-03 16:36:31 +0000 UTC"
        },
        {
            "comment": "The first day of class, she told everyone to expect to get a C, maybe a B-. Lectures are very confusing, skipping over ideas and parts of problems. Tests are difficult, but she can be generous with partial credit. There is a curve. I think you would be better off if you have taken physics before. Overall, she was nice, just not a great professor.",
            "tags": "",
            "class": "PHYS31",
            "date": "2025-03-30 23:45:10 +0000 UTC"
        },
        {
            "comment": "Quite possibly the worst teacher I've had ever. Doesn't explain material well at all. I took physics in high school and even that only took me so far. If you have no other choice, take physics next quarter. Don't suffer like all of us have.",
            "tags": "Tough grader",
            "class": "PHYSICS",
            "date": "2025-03-21 18:04:11 +0000 UTC"
        },
        {
            "comment": "Makes it so hard on students with the tests and horrible lectures. She sets a timer at the start of lecture and lets it run till end. Confusing overall",
            "tags": "Lots of homework--Lecture heavy--Test heavy",
            "class": "PHYSICS",
            "date": "2025-03-20 03:13:55 +0000 UTC"
        },
        {
            "comment": "Confusing, does not explain topics in detail, thick accent very hard to understand overall, I come out of lectures more confused than when I came in. Only reason I've done well is because I took physics in high school.",
            "tags": "Tough grader--Test heavy",
            "class": "PHYSICS",
            "date": "2025-03-08 00:58:09 +0000 UTC"
        },
        {
            "comment": "Absolutely one of the best professors I had by far. Always willing to help students when they're stuck. Quizzes are hella easy.",
            "tags": "Inspirational--Hilarious--Caring",
            "class": "PHYSICS",
            "date": "2025-02-28 08:15:22 +0000 UTC"
        },
        {
            "comment": "&#20013;&#24335;&#25945;&#25480;&#65292;&#32433;&#31508;&#19968;&#20010;",
            "tags": "Tough grader",
            "class": "PHYSICS",
            "date": "2025-02-28 02:23:18 +0000 UTC"
        },
        {
            "comment": "This professor's broken English made the course incredibly difficult to understand. Lectures were confusing and key concepts were poorly explained. Excessive weight on exams created unfair pressure. Feedback was minimal and unhelpful.",
            "tags": "Tough grader--Get ready to read--Graded by few things",
            "class": "PHYSICS",
            "date": "2025-01-08 09:41:24 +0000 UTC"
        },
        {
            "comment": "At first, she seemed very nice. But her lectures weren't good at all. Her handwriting is hard to read and lectures notes are all over the place. All I did was to do the problems from the HW/textbook & slides. Next time she should improve her teaching style.\n\nAn advice from me: don't take her if you want to suffer badly and got better choices.",
            "tags": "Tough grader--Caring--Lecture heavy",
            "class": "PHYSICS",
            "date": "2024-10-11 03:47:42 +0000 UTC"
        },
        {
            "comment": "Very challenging class and not well taught. Put in a lot of effort just for her to tell me to drop. Do not recommend. ",
            "tags": "",
            "class": "PHYSICS",
            "date": "2024-10-10 19:20:05 +0000 UTC"
        },
        {
            "comment": "She's a nice person, and she's willing to help students outside of class, but she's not a good lecturer. She has a heavy accent, her handwriting is messy, and her method of lecturing is difficult to understand. I only got a B cuz I took physics in high school.",
            "tags": "Tough grader--Lots of homework--Test heavy",
            "class": "PHYSICS",
            "date": "2024-08-19 22:15:23 +0000 UTC"
        },
        {
            "comment": "Honestly a joke of a class. I honestly think if a 6th grader took over and taught the class I would have had a better concept of physics. Impossible to understand her with her accent and lectures are a complete snoozefest.  Skipping and attending the class yield the same result. Complete the homework and you'll be somewhat successful. ",
            "tags": "Get ready to read--Hilarious--Lecture heavy",
            "class": "PHYSICS",
            "date": "2024-06-24 02:10:40 +0000 UTC"
        },
        {
            "comment": "Hard to understand and pretty scattered with her notes looking like scribbles on a page. Class averages on tests were around 65 and she does not curve. If you end up getting her, good luck",
            "tags": "Tough grader--Lecture heavy",
            "class": "PHYSICS",
            "date": "2024-06-19 06:32:16 +0000 UTC"
        },
        {
            "comment": "My best way to describe Shan Wu is that she is very knowledgeable, however, the language barrier can be difficult. The 2 midterms and final will be worth 80% of your grade. The class wasn't as bad for me since I had taken AP Physics, but speaking for the students in my class who hadn't ever seen Physics, this was brutal. ",
            "tags": "Tough grader--Test heavy--Graded by few things",
            "class": "PHYSICS",
            "date": "2024-06-19 01:56:39 +0000 UTC"
        },
        {
            "comment": "I personally think she is the best physics professor you can have in Santa Clara University. She has great personality and is willing to help students during test if they have questions about the problems. Her quizzes are pretty straightforward and all the problems are expected. ",
            "tags": "Amazing lectures --Clear grading criteria--Caring",
            "class": "PHYSICS",
            "date": "2024-05-31 07:08:39 +0000 UTC"
        },
        {
            "comment": "I love her. She grades leniently and all the questions on the exams are either covered in class or homework questions. If you have done your homework you'll definitely get an A! I've also taken physics courses taught by other professors, but she's still my favorite!",
            "tags": "",
            "class": "PHYSICS",
            "date": "2024-05-31 07:02:33 +0000 UTC"
        },
        {
            "comment": "A little hard to understand but do practice problems from hw/textbook and lecture and you should be fine. Beware of her handwriting tho ",
            "tags": "Tough grader--Lots of homework--Test heavy",
            "class": "PHYSICS",
            "date": "2024-05-11 21:24:19 +0000 UTC"
        },
        {
            "comment": "I hated everything, there was no point in even going to the lectures as she made no sense. She should not be allowed to teach, she never did examples that made any sense. Everything was conceptual and not explained well at all. If you get her drop it immediately you will learn nothing. ",
            "tags": "Tough grader--Lots of homework--Test heavy",
            "class": "PHYSICS",
            "date": "2024-04-30 04:11:56 +0000 UTC"
        },
        {
            "comment": "Although the Professor is very nice and caring (comforts students, happy to go over any problem) she needs to improve her teaching style and handwriting as well. Comes to lectures with lots of notes so she FLIES over the examples by writing down answers and barely explains why she is writing down what. Her handwriting is almost a hurdle to go over",
            "tags": "Lots of homework--Test heavy--Accessible outside class",
            "class": "PHYSICS",
            "date": "2024-03-29 20:11:19 +0000 UTC"
        },
        {
            "comment": "- Bad speech/handwriting\n- Read directly from the textbook\n- Be ready to teach yourself and pay for external resources\n- Grading's inconsistent\n- Can't finish a lecture on time\n- Majority did poorly on tests: lectured to study harder. Being told, I am not working hard enough when I spend more hours in the library than asleep is insulting.\nAVOID!!",
            "tags": "Get ready to read--Lots of homework--Graded by few things",
            "class": "PHYSICS",
            "date": "2024-03-18 06:56:11 +0000 UTC"
        },
        {
            "comment": "It's very hard to understand her and she rarely explains concepts. She solves a problem on the board of which you can't really understand what's going on and then the test throw in new concepts you haven't seen before and she takes off points very harshly and randomly. Avoid her if possible. I only did well because I took the class in high school.",
            "tags": "",
            "class": "PHYSICS",
            "date": "2024-03-12 18:07:27 +0000 UTC"
        },
        {
            "comment": "The same has already been said but she is difficult to understand through her accent and handwriting, and dances around any questions asked resulting in arguably even more confusion. A typical class will look like copying down the ~3 example problems and glossing over conceptual material. If you end up taking her class, best of luck. ",
            "tags": "Get ready to read--Test heavy--Graded by few things",
            "class": "PHYSICS",
            "date": "2024-02-25 22:36:57 +0000 UTC"
        },
        {
            "comment": "She's a great person, not a great teacher makes understanding basic physics concepts more difficult leading to even more studying and work outside of class. Her accent makes understanding difficult and she just talks about the topic without giving real details regarding how to approach the problems and just writing down the answers.",
            "tags": "Tough grader--Get ready to read--Test heavy",
            "class": "PHYSICS",
            "date": "2024-02-23 22:45:55 +0000 UTC"
        },
        {
            "comment": "Shan Wu is the right professor if you want to get Shanked and Wupped. All of her examples are from the book and she just rewrites her notes in class. I went to a couple of the office hours and she just freaks out when people ask basic questions. Expected students to study 40hrs a week. Heavy accent and bad handwritting. 60 -> 30 students by the end",
            "tags": "Tough grader--Lots of homework",
            "class": "PHYSICS",
            "date": "2024-02-12 23:45:58 +0000 UTC"
        },
        {
            "comment": "She teaches straight from the textbook and doesn't give equation sheets for tests.  Strong accent and bad handwriting during lectures.  Do not take this class.",
            "tags": "Tough grader--Get ready to read--Test heavy",
            "class": "PHYSICS",
            "date": "2023-12-15 00:30:52 +0000 UTC"
        },
        {
            "comment": "Hard grader, teaches by reading straight off textbook, hard to understand lectures, but shes very available outside of class ",
            "tags": "Tough grader--Get ready to read",
            "class": "PHYSICS",
            "date": "2023-12-06 16:23:37 +0000 UTC"
        },
        {
            "comment": "Avoid at all costs",
            "tags": "Tough grader--Test heavy",
            "class": "PHYSICS",
            "date": "2023-12-05 22:09:15 +0000 UTC"
        },
        {
            "comment": "Used to love physics she made me hate it.",
            "tags": "Tough grader",
            "class": "PHYSICS",
            "date": "2023-12-03 20:42:21 +0000 UTC"
        },
        {
            "comment": "I had her for PHYS 33 which is already very difficult course and she doesn't make it easier. It was her first year teaching and it was incredibly difficult to understand her lectures. Her handwriting isn't great and she moves very fast with barely any explanations. It was basically a self-taught class. Very condescending. AVOID AT ALL COSTS.",
            "tags": "",
            "class": "PHYSICS",
            "date": "2023-11-15 21:04:57 +0000 UTC"
        },
        {
            "comment": "Her first year teaching and it is extremely apparent in lectures. Condescending tone when discussing class averages and she is difficult to understand during lectures AND office hours. Physics 33 is already tough enough so avoid Wu if possible! ",
            "tags": "Tough grader",
            "class": "PHYSICS",
            "date": "2023-11-12 07:32:19 +0000 UTC"
        },
        {
            "comment": "Ive only had good experiences with teachers in the PHYS department but taking PHYS33 with Shan Wu has been far from that. This is her first class she is teaching and its on display each class. Very condescending in class announcements about test averages. Told students to drop the class after the final drop date. I would avoid Shan Wu if possible",
            "tags": "",
            "class": "PHYSICS",
            "date": "2023-11-05 20:21:03 +0000 UTC"
        },
        {
            "comment": "Super nice person, not the best prof (granted, this was her first yr teaching so she's still new), but unclear lectures & hard to follow. Goes into too much detail & is hard to distinguish what's important or not from lectures. Tough grader too. Physics 33 in general is a challenging course so that plays a role, but overall wouldn't take her again.",
            "tags": "Tough grader",
            "class": "PHYSICS",
            "date": "2023-10-26 05:12:49 +0000 UTC"
        }
    ]
}